src/cf/DataProcessors/УС_ОбработкаТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>УС_ОбработкаТестирования</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/УС_ИсходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УС_ИсходящиеСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УС_СтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УС_ТипыСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/УС_ИнформацияПоСертификатам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УС_ИнформацияПоСертификатам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/УС_ТипыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>УС_ТипыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктивацияКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Баланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/УС_ОбработкаТестирования/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти


#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура АктивироватьКарту(Команда)
	АктивироватьКартуНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьСписание(Команда)
	ВыполнитьСписаниеНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура ИнформацияПоКарте(Команда)
	ИнформацияПоКартеНаСервере();
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АктивироватьКартуНаСервере() 
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ТипСообщения = XMLСтрока(Перечисления.УС_ТипыСообщений.АктивацияКарты);
	
	
	//Формируем тело сообщения
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ТипСообщения", ТипСообщения); 
	СтруктураСообщения.Вставить("НомерСертификата", НомерСертификата); 
	СтруктураСообщения.Вставить("Номинал",  Номинал);
	СтруктураСообщения.Вставить("Владелец", Владелец);
	
	ТелоСообщения = УС_ОтправкаПолучениеСообщенийСервер.СтруктуруВJSON(СтруктураСообщения);
	ИдентификаторСообщения = СокрЛП(Новый УникальныйИдентификатор);
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ИдентификаторСообщения", ИдентификаторСообщения);
	СтруктураСообщения.Вставить("ТелоСообщения", ТелоСообщения); 
	СтруктураСообщения.Вставить("ТипСообщения", Перечисления.УС_ТипыСообщений.АктивацияКарты);
		
	РегистрыСведений.УС_ИсходящиеСообщения.ЗаписатьСообщение(СтруктураСообщения); 
	
	Сообщить("Сообщения сформировано");  
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ОтправкаАктивацииКарты",ВремяНачалаЗамера);
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьСписаниеНаСервере() 
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ТипСообщения = XMLСтрока(Перечисления.УС_ТипыСообщений.Списание);
	
	
	//Формируем тело сообщения
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ТипСообщения", ТипСообщения); 
	СтруктураСообщения.Вставить("НомерСертификата", НомерСертификата); 
	СтруктураСообщения.Вставить("Списать",  Списать);
		
	ТелоСообщения = УС_ОтправкаПолучениеСообщенийСервер.СтруктуруВJSON(СтруктураСообщения);
	ИдентификаторСообщения = СокрЛП(Новый УникальныйИдентификатор);
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ИдентификаторСообщения", ИдентификаторСообщения);
	СтруктураСообщения.Вставить("ТелоСообщения", ТелоСообщения); 
	СтруктураСообщения.Вставить("ТипСообщения", Перечисления.УС_ТипыСообщений.Списание);
		
	РегистрыСведений.УС_ИсходящиеСообщения.ЗаписатьСообщение(СтруктураСообщения); 
	
	Сообщить("Сообщения сформировано");

	ОценкаПроизводительности.ЗакончитьЗамерВремени("ОтправкаСписания",ВремяНачалаЗамера);
	
КонецПроцедуры

&НаСервере
Процедура ИнформацияПоКартеНаСервере()
	
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УС_ИнформацияПоСертификатамСрезПоследних.Период КАК Период,
	               |	УС_ИнформацияПоСертификатамСрезПоследних.НомерСертификата КАК НомерСертификата,
	               |	УС_ИнформацияПоСертификатамСрезПоследних.Остаток КАК Остаток,
	               |	УС_ИнформацияПоСертификатамСрезПоследних.Владелец КАК Владелец
	               |ИЗ
	               |	РегистрСведений.УС_ИнформацияПоСертификатам.СрезПоследних(, НомерСертификата = &НомерСертификата) КАК УС_ИнформацияПоСертификатамСрезПоследних";
	Запрос.УстановитьПараметр("НомерСертификата", НомерСертификата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ОбщегоНазначения.СообщитьПользователю("Сертификат %1 остаток %2 владелец %3", 
		                                                  Выборка.НомерСертификата,
		                                                  Выборка.Остаток,
		                                                  Выборка.Владелец);
		
	КонецЕсли;	
													  
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ПолучениеИнформацииПоКарте",ВремяНачалаЗамера);												  
	
КонецПроцедуры
 
#КонецОбласти
